{
    "0": {
        "reddit": "stories",
        "posts": [
            {
                "id": "t3_13x2abr",
                "title": "nobody would believe me if i told them now",
                "text": "(sorry for bad english)Growing up me and my friends had a game during middle school there a big parking lot that the teachers never used it was far away from the school. So we would walk to it and bring things like rocks and build there. We would make shops where the sticks were money at the end of recess we would pile the sticks together. Split them with the government that we created i was the president. I would get about 12 to 15 sticks everyday and trade them for school easers that would later become shop items that we would later sell again. we used to make houses with the sticks everyday a stick would be taken off of the house if somebody did not pay taxes. we would make games called war where we would throw rocks at each other this started if a worker did not like the pay they were getting. The cycle repeated until 8th grade when we had no recess."
            },
            {
                "id": "t3_13xfm7u",
                "title": "may she rest in peace",
                "text": "i owned a cat named dolly i never named her but my little sister did one day I got a call by my step dad he was crying on the phone saying that something happened to the cat she was ran over by a truck. The truck owner felt so bad that he gave us his dog I named the dog dolly just like the cat may she rest in peace."
            },
            {
                "id": "t3_13xmdym",
                "title": "Random thoughts of a dying man.",
                "text": "Well, I guess I should start at the beginning the majority of all stories tend to start. I was born in Detroit, Michigan in the month of June 1977. I was soon adopted and never met my biological family but have been told that I have two biological sisters, Karen, and Xinea as well as two brothers named Robert, and Jerry(perhaps Gerry I suppose). My mother is Patricia Bray, and my alleged father is Carl Ambers according to the adoption records that I found after the death of my adopted mother, Opal in 2001; I was a grown man by then. I was adopted by Opal and Frank Smith(we will say) in 1978. Somehow they knew my biological mother but that connection was never revelled to me. Opal was one of 17 children who grew up on a mountain somewhere in West Virginia. I was told that her father killed himself in front of her and her siblings when she was less than 10 years old. He was a coal miner and was injured in some type of accident and left unable to work with 19 mouths to feed; hard to fathom but for the love of God why in front of the children? Regardless of his reason this event left a lasting impact upon his 9 year old daughter that would ripple throughout space and time with the force of an atomic bomb; to this day that act and subsequent reaction linger. Opal was a devout Pentecost, Southern Baptist, or whatever similar religion she felt; not exactly sure. She was once a member of the People's Temple church in the early days when they were in Indianapolis (circa 1953-54). She left the church when the new leader, a man by the name of Jim Jones took over and began to allow people of other races into the fellowship; Opal being a woman of God as well as a devout racist left the church. They would later commit forced suicide in Ghana by drinking cyanide laced drinks at the end of machine guns. Opal was a small woman and she had many older brothers. She spent her developmental years fatherless, emotionally wrecked, and on a mountain with those brothers; I do not wish to even imagine what that must have been like, but one thing is for certain; she grew up mean and she knew how to fight, how to hurt a person, and how to use her 4' 11\" 120lbs to do damage. Her temper was short and she was fast to react in a violent physical nature. She was married to Frank who was from Kentucky. Frank ran a laundry delivery service, smoked cigars, and loved pro wrestling. He was already in his forties when I was adopted as was Opal. Frank was amazing to me as a young child but as time went on he became isolated and didn't much bother with anything other than work. Looking back it is obvious he was terribly unhappy but that is unfortunately the theme of this story. I also had three adopted sisters that we shall call Kay, Mary, and Carry. All of whom were already 10 and older once I was brought into the household. The six of us lived in a two bedroom single bath home on the south side of Indianapolis. My earliest memory is literally the day that they brought me to their house; you may think that is crazy, a child less than a year old having a vivid memory but I swear to you I do. I remember being brought into the kitchen and being placed into a high chair with a pack of saltines....then a bath and to bed. For the first few years it seemed that we had a happy, perfect family. Frank made good money and so Opal stayed home and managed the house while watching me. I remember how nice she was at first but that would soon change, everything changed. The early eighties were a rough time economically and it showed. The stress of life really brought out the mean in Opal, she would fly off the handle in a millisecond flat. I was a very advanced child for my age and by pre-school I could count to 1000, read children's books myself, and I knew all my shapes and colors beyond the standard \"circle, square, blue, red\". My adopted parents were not very well educated and I think they were taken aback by the rate at which I absorbed information. It could not possibly be that this child simply has a thirst for knowledge and an ability to process things; it must be DEMONS...yep, folks, demons. From the time I was maybe 3 until I stopped speaking to Opal circa 1999 I was repeatedly told that I was \"FULL OF DEMONS\" as well as the everpopular\"YOU ARE GOING TO HELL FOR _________\" Now you can add whatever you wish to that blank up there because she sure did. I was going to hell for running in the house, catching insects, not going to bed on time, throwing rocks, playing with sticks, you name it, and he'll was fucking terrifying. I was taken to churches where people preached that the devil was not among us , but inside of us all!!! and as I watched them shake and scream and yell it honestly scared the shit out of me. Being a developing child and being told you are possessed by creatures from hell may have a lasting mental effect. Like many kids I began to rebel against and since I was full of demons I began to act accordingly. Things in the household spiraled downward like a toy boat circling an open drain. Opal was becoming aloof and isolated, coming from her bedroom only to cuss, complain, and rage. After the first few times getting my ass or face slapped up I learned to shut my mouth but unfortunately my older adopted sister Mary never got that lesson. She was about early high school age when I was adopted but I do not remember either of my two oldest sisters going to school at all. She like rock music of the time, she didn't dress appropriately, she was loud, and she did not listen to anything she was told. She was a typical teen girl in the 80's until she snuck out one night and some men snuck PCP into her drink. She had a bad reaction and seized, they just dumped her from the car onto a cold, dark Indianapolis street corner in the middle of a ghetto where she lay until found. She was rushed to the hospital where she died and was revived many time; luckily she lived, but she had went without oxygen and it left her with some mental impairment. She never really progressed past a teen mentality. I do not know if it was shame at her sneaking out with men and being discovered or the lingering mental illness but Opal had a fire for her like no other. They once had a shouting match over what Mary was wearing and after a few minutes Opal picked up an old golf wedge club that I had found and began to beat her savagely. I counted at least 30 shots before I got the courage to jump in from of her; I was maybe 8 years old. The following years would show a pattern of such actions with all four of us occasionally getting it but Mary and myself got the brunt of things...there were hot off the stove spatulas to bare skin, broomsticks, rake handles, and even the cast iron skillet with hot oil still inside. My father, having been introduced to Opal's violent nature knew better than to intervene, choosing to withdraw all together of the situation. Left to free rein Opal never missed an opportunity to abuse physically, or verbally. I remember being perhaps 9-10 years old and being as my parernts were way older I dressed like I was from the 60's,. Opal had since went to work at a metal polishing factory and I was left to the daily care of three teenage, adopted sister with no clue about basic hygiene so I smelled terrible and the stress of my violent home life had put weight on me other kids fucked with me hardcore. I had had a terrible day at school; my pants had ripped and all the other kids were laughing and calling me fatass and such literally all day long. So I get home finally and I totally break down into hesterical crying fits to which my \"mother\" responds to be yelling \"BOY!!....WHAT IS ALL THE NOISE ABOUT!!?!\" and through tears and in broken English I struggled to explain the events of the day and how all the kids said I \"stink and that my clothes were trash and that I was too fat!!\" and her caring response was to look me dead in my eyes and yell to me \"YOU ARE FAT AND I AM NOT BUYING YOU NEW CLOTHES UNTIL YOU LOSE SOME WEIGHT!!\" This event would truly cast a demon of hatred and anger deep into my soul that I would struggle to shake for the next 20 or more years. The next day at school, on recess a group of slightly younger children began to gather around me and began the usual verbal and physical harassment. As they had a few days previous they were attempting to set me up for that trick where one person gets down in a dog-like pose behind you while you are distracted and once in place the other push you over and everyone has a grand old laugh at your expense while you struggle to get your fat ass off the ground and get your wind back but that day I was not playing that shit and so when the little fucker ducked down behind me I immediately swung around with my right foot and landed a vicious snap kick directly to his eye socket; the sound of it breaking echoed the playground followed by painful wailing. It felt good to hear, it felt good to see the fear in the eyes of his friend's eyes, to send a message that I was no longer their victim or anyone else's for that matter. I started skipping school, vandalizing, petty theft, shoplifting, and anything other than wholesome which got me arrested for stealing CD's and Transformers from K-Mart. L.L. Cool J.....funny the shit you value when you look in retrospect. The ride home from the juvenile center on East 21st street was a long one and I was petrified of the beating that awaited me as new and different ways and items to beat the fuck from me danced in my head like those fucking sugar-plums from that stupid Christmas Song. When we finally got back to our house in Fountain Square I was directed into the kitchen where a length of 2/4 about 2 foot long waited on the kitchen table. Opal from behind me yelled out \"BOY!!\" which was what I was always referenced as as if I had no fucking name and when I did a 180 she belted me across my face with a hard right fist, but unlike every other time she hit me I did not scream out, cry, or even flinch from the blow. This further infuriated her and so she struck my face again to the same result, and again, and again until I firmly grabbed her right wrist at which point she immediately hit me with a hard left and I subsequently grabbed her left wrist. I was about 175lbs if not more and my strength overpowered her ability to strike me and when she realized that she could not move and seen in my eyes that this was not going to happen she began to scream \"LET GO OF ME!!\" to which I replied \"I am going to let you go and when I do you are not going to fucking touch me in any way!!\"...I let go, and defeated she walked away. After that she offered no real support other than a place to sleep. I began to steal clothing from people's clotheslines and after wearing the same pair of shoes for so long that my feet are literally deformed, I took a pair of Nikes off of someone's porch. Over the next few years I would have many more legal troubles, assaults, thefts, arsons until the State of Indiana stepped in and made me a ward of the state. I was sentenced and sent to a place called Glen Mills Schools in Concordville, Pennsylvania. It was supposed to be a fresh start and a chance to better myself and I was able to get my HSE, learn computer aided drafting, and I got to compete in powerlifting as well. It was the first time in my life I had seen a dentist even; I was 15 years old and finally I felt hopeful and happy; that would soon change."
            },
            {
                "id": "t3_13xjv2p",
                "title": "true story",
                "text": "3 years ago i met my ex which helped me to change my lifestyle , i started calistanics , changed my mindset , focused on self improvement , 2 years ago my gf broke up whit me , i expirianced a psicotic event and got addmitied to a mental assylum multiple times , the doctors found a brain tumor in my head , i got deppressed and fat , 1 year ago i rememberd my dream to become a boxer , the promise i made to myself and to my ex , i went to the doctors and each of them told me no give it up you will not be a boxer , my friends left me , my best friend said to give up on my dream , my parents told me its not gonna happen , my ex told me to find other things , all those no's were like water on my flame , nevertheless a spark remained , as i continew to push forward , seeking doctors one after the other to get premmission to box even whit my brain tumor , eventualy i met a proffesor who gave me premmision to start to box , a door has been open to me as i work towards my dream , my vision , its not over until i win ! , dont give up , ask for the thing that you want and work for it , you will get beaten , you will fail , you will suffer , continew to rise up eventualy life will surrender to you ."
            },
            {
                "id": "t3_13x2oez",
                "title": "...well",
                "text": "during first grade i had a crush on some guy he was on the chubby side and would make fun of other students for their own size dispite being bigger then most of them. One day he came into the room and i noticed something weird. He was sucking in his stomach to appear more thin. He kept doing this until last period when he could not hold it anymore, he sat down and the chair broke and the teacher while helping him tried not to laugh her face was red."
            }
        ]
    },
    "1": {
        "reddit": "funnystories",
        "posts": [
            {
                "id": "t3_13xp7k6",
                "title": "Haven't thought about this in years",
                "text": "Me and my two best friends growing up were playing outside, when we saw a guy running full speed up the sidewalk in our direction. He was running past and my one friend goes \"what'd you steal this time?\" The guy slows down for a sec and goes \"fuck you!\" Lol"
            },
            {
                "id": "t3_13xij7y",
                "title": "Princess and her weird condition for marriage",
                "text": "There was a princess and she kept a condition that she will marry that person who will drink three glasses of her spit. Many could not even start. But there was one guy who drank 2 glasses and suddenly he stopped. Princess asked him \"oh you are also giving up?\" And he replied \"no dear princess.. i was chewing your cough\"\nDoes anyone know any similar stories? I found this one ages ago god knows from where. Hoping to read more quirky stories like this!!"
            },
            {
                "id": "t3_13xan9y",
                "title": "I destroyed the bathroom and now she stopped texting me",
                "text": "Let me clarify what i mean by destroy. That day i had eaten two bags of doritos with a lot of nacho cheese. Not the tiny 50 cent bags but the family size. The girl i was interested in invited me to watch a movie at her place. Things were going well until that first sloppy fart ripped through the silence. I asked to use her bathroom and she pointed down the hall.\nOnce inside i proceeded to unleash the most foul bowel movement I've had in my life. It was loud and almost cartoon like. I held on to my knees and was almost brought to tears by the vicious explosions behind me. She knocked on the door and told me in qoute, \"Your ass stinks, get the hell out.\" Do to the fact she could smell it throughout the f house. I had been in there spilling my soul into the toilet bowl for about 15-20 minutes straight."
            }
        ]
    }
}